# AGGREGATION AND GROUPING

## Generally aggregate means combining several seperate elements

### import the libraries

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

# AGGREGATION METHODS AND ITS DESCRIPTION

In [2]:
ag=  [["count()"	,"Total number of items"],
     ["first(), last()","First and last item"],
     ["mean(), median()","Mean and median"],
     ["min(), max()","Minimum and maximum"],
     ["std(), var()","Standard deviation and variance"],
     ["mad()","Mean absolute deviation"],
     ["prod()","Product of all items"],
     ["sum()","Sum of all items"]]
print("AGGREGATION        :      DESCRIPTION")
for item in ag:
    print(item[0]," "*(17-len(item[0])),":",item[1])

AGGREGATION        :      DESCRIPTION
count()            : Total number of items
first(), last()    : First and last item
mean(), median()   : Mean and median
min(), max()       : Minimum and maximum
std(), var()       : Standard deviation and variance
mad()              : Mean absolute deviation
prod()             : Product of all items
sum()              : Sum of all items

In [3]:
planets= sns.load_dataset('planets')
planets

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [4]:
planets.shape

(1035, 6)

In [5]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

# SIMPLE AGGREGATION IN PANDAS

In [6]:
rng = np.random.RandomState(42)
ser= pd.Series(rng.rand(5))
ser

0    0.374540
1    0.950714
2    0.731994
3    0.598658
4    0.156019
dtype: float64

In [7]:
ser.sum()

2.811925491708157

In [8]:
ser.mean()

0.5623850983416314

In [9]:
ser.median()

0.5986584841970366

In [10]:
df= pd.DataFrame({'a':rng.rand(5),
                 'b':rng.rand(5)})
df

          a         b
0  0.155995  0.020584
1  0.058084  0.969910
2  0.866176  0.832443
3  0.601115  0.212339
4  0.708073  0.181825

In [11]:
i = pd.date_range('2019-06-11', periods=9, freq='2D')
ts = pd.DataFrame({'A': [1,2,3,4,6,7,8,9,10]}, index=i)
print(ts,"Data Sets")

             A
2019-06-11   1
2019-06-13   2
2019-06-15   3
2019-06-17   4
2019-06-19   6
2019-06-21   7
2019-06-23   8
2019-06-25   9
2019-06-27  10 Data Sets

In [12]:
print(ts.first('3D'),"First Data")
print(ts.last('3D'),"Last Data")

            A
2019-06-11  1
2019-06-13  2 First Data
             A
2019-06-25   9
2019-06-27  10 Last Data

In [13]:
df.mean()

a    0.477888
b    0.443420
dtype: float64

In [14]:
df.mean(axis='columns')

0    0.088290
1    0.513997
2    0.849309
3    0.406727
4    0.444949
dtype: float64

In [15]:
planets.dropna().describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

# GROUPBY SPLIT COMBINE

This makes clear what the groupby accomplishes:

1 The split step involves breaking up and grouping a DataFrame depending on the value of the specified key.

2 The apply step involves computing some function, usually an aggregate, transformation, or filtering, within the individual groups.

3 The combine step merges the results of these operations into an output array.

In [16]:
df = pd.DataFrame({'key':['a','b','c','a','b','c','d'],
                  'data':range(7)},columns=['key','data'])
df

  key  data
0   a     0
1   b     1
2   c     2
3   a     3
4   b     4
5   c     5
6   d     6

In [17]:
a=df.groupby('key')
a

To produce a result, we can apply an aggregate to this DataFrameGroupBy object, which will perform the appropriate apply/combine steps to produce the desired result:

In [18]:
df.groupby('key').sum()

     data
key
a       3
b       5
c       7
d       6

# The GroupBy object

### The GroupBy object is a very flexible abstraction. In many ways, you can simply treat it as if it's a collection of DataFrames, and it does the difficult things under the hood. Let's see some examples using the Planets data.

### Perhaps the most important operations made available by a GroupBy are aggregate, filter, transform, and apply. We'll discuss each of these more fully in "Aggregate, Filter, Transform, Apply", but before that let's introduce some of the other functionality that can be used with the basic GroupBy operation.

## Column indexing
### The GroupBy object supports column indexing in the same way as the DataFrame, and returns a modified GroupBy object. For example:

In [19]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [20]:
planets.groupby('method')['orbital_period']

In [21]:
planets.groupby('method')['orbital_period'].median()

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

In [22]:
for (method,group) in planets.groupby('method'):
    print("{0:50s} shape={1}".format(method, group.shape))

Astrometry                                         shape=(2, 6)
Eclipse Timing Variations                          shape=(9, 6)
Imaging                                            shape=(38, 6)
Microlensing                                       shape=(23, 6)
Orbital Brightness Modulation                      shape=(3, 6)
Pulsar Timing                                      shape=(5, 6)
Pulsation Timing Variations                        shape=(1, 6)
Radial Velocity                                    shape=(553, 6)
Transit                                            shape=(397, 6)
Transit Timing Variations                          shape=(4, 6)

### dispatch methods

In [23]:
planets.stack()

0     method            Radial Velocity
      number                          1
      orbital_period              269.3
      mass                          7.1
      distance                     77.4
                             ...
1034  method                    Transit
      number                          1
      orbital_period            4.18776
      distance                      260
      year                         2008
Length: 5418, dtype: object

In [24]:
planets.groupby('method').describe().unstack()

               method
number  count  Astrometry                          2.0
               Eclipse Timing Variations           9.0
               Imaging                            38.0
               Microlensing                       23.0
               Orbital Brightness Modulation       3.0
                                                 ...
year    max    Pulsar Timing                    2011.0
               Pulsation Timing Variations      2007.0
               Radial Velocity                  2014.0
               Transit                          2014.0
               Transit Timing Variations        2014.0
Length: 400, dtype: float64

# AGGREGATE, FILTER, Apply

In [25]:
rng = np.random.RandomState(0)
df = pd.DataFrame({'key':['a','b','c','a','b','c'],
                  'data1':range(6),
                  'data2':rng.randint(0,10,6)},
                 columns=['key','data1','data2'])
df

  key  data1  data2
0   a      0      5
1   b      1      0
2   c      2      3
3   a      3      3
4   b      4      7
5   c      5      9

# Aggregation

In [26]:
df.groupby('key').aggregate(['min',np.median,max])

    data1            data2
      min median max   min median max
key
a       0    1.5   3     3    4.0   5
b       1    2.5   4     0    3.5   7
c       2    3.5   5     3    6.0   9

In [27]:
df.groupby('key').aggregate({'data1':'min',
                            'data2':'max'})

     data1  data2
key
a        0      5
b        1      7
c        2      9

### filtering

In [28]:
def filter_func(x):
    return x['data2'].std()>4
df.groupby('key').filter(filter_func)

  key  data1  data2
1   b      1      0
2   c      2      3
4   b      4      7
5   c      5      9

In [29]:
df.groupby('key').std()

       data1     data2
key
a    2.12132  1.414214
b    2.12132  4.949747
c    2.12132  4.242641

In [30]:
df.groupby('key').filter(filter_func)

  key  data1  data2
1   b      1      0
2   c      2      3
4   b      4      7
5   c      5      9

# TRANSFROMATIONS

In [31]:
df.groupby('key').transform(lambda x:x - x.mean())

   data1  data2
0   -1.5    1.0
1   -1.5   -3.5
2   -1.5   -3.0
3    1.5   -1.0
4    1.5    3.5
5    1.5    3.0

# apply method()

In [32]:
def norm_by_data2(x):
    #x is a dataframe of group values
    x['data1'] /= x['data2'].sum()
    return x
df.groupby('key').apply(norm_by_data2)

  key     data1  data2
0   a  0.000000      5
1   b  0.142857      0
2   c  0.166667      3
3   a  0.375000      3
4   b  0.571429      7
5   c  0.416667      9

In [33]:
df.groupby('key').apply(norm_by_data2)

  key     data1  data2
0   a  0.000000      5
1   b  0.142857      0
2   c  0.166667      3
3   a  0.375000      3
4   b  0.571429      7
5   c  0.416667      9

## specifying the split key

In [41]:
l=[0,1,0,1,2,0]
df.groupby(l).sum() ## here [0,1,0,1,2,0] = [0,1,2,3,4,5] in df

   data1  data2
0      7     17
1      4      3
2      4      7

In [35]:
df

  key  data1  data2
0   a      0      5
1   b      1      0
2   c      2      3
3   a      3      3
4   b      4      7
5   c      5      9

In [36]:
df.groupby(df['key']).sum()

     data1  data2
key
a        3      8
b        5      7
c        7     12

### A dictionary or series mapping index to group

In [37]:
df2 = df.set_index('key')
mapping = {'a':'vowel','b':'consonent','c':'consonent'}
df2.groupby(mapping).sum()

           data1  data2
consonent     12     19
vowel          3      8

In [38]:
df2

     data1  data2
key
a        0      5
b        1      0
c        2      3
a        3      3
b        4      7
c        5      9

In [39]:
df2.groupby(str.lower).mean()

   data1  data2
a    1.5    4.0
b    2.5    3.5
c    3.5    6.0

In [40]:
df2.groupby([str.lower,mapping]).mean()

             data1  data2
a vowel        1.5    4.0
b consonent    2.5    3.5
c consonent    3.5    6.0